doublebooking141/handy_keyboard/03.firmware/04.integratedAPP/sdkconfig.defaults
# Handy Keyboard - Integrated Application
# ESP32-P4 + ESP32-C6 (ESP-Hosted over SDIO)

# Target chip
CONFIG_IDF_TARGET="esp32p4"

# Flash configuration
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152
CONFIG_SPIRAM_MEMTEST=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Cache configuration
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Log level - Info for production, Debug for development
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y

# Experimental features (required for ESP32-P4)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ============================================
# ESP-Hosted Configuration (SDIO transport)
# ============================================
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_SDIO_HOST_INTERFACE=y

# ============================================
# WiFi Configuration (via ESP-Hosted)
# ============================================
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ============================================
# Bluetooth Configuration (NimBLE via ESP-Hosted)
# ============================================
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# IMPORTANT: Disable UART transport to use VHCI
CONFIG_BT_NIMBLE_TRANSPORT_UART=n

# ESP-Hosted BT configuration (VHCI over SDIO)
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

# NimBLE settings
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# GAP device name
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="Handy Keyboard"

# Enable NimBLE debug logs (disable in production)
# CONFIG_BT_NIMBLE_DEBUG=y
# CONFIG_BT_NIMBLE_LOG_LEVEL_DEBUG=y

# ============================================
# Slave (C6) Configuration
# ============================================
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
